:PROPERTIES:
:ID:       7e249727-e935-4729-87a9-d575fc34052e
:END:
#+TITLE: The Vlasov equation
#+FILETAGS: :problem: :SPOP: :statmech:
#+SETUPFILE: ~/.config/emacs/setup/setupfile.org
#+BEGIN: clocktable :maxlevel 2 :scope nil :emphasize nil
#+CAPTION: Clock summary at [2024-04-25 Thu 04:02]
| Headline                | Time   |
|-------------------------+--------|
| *Total time*            | *2:12* |
|-------------------------+--------|
| 3.3 The Vlasov equation | 2:12   |
#+END
* 3.3 The Vlasov equation
:LOGBOOK:
CLOCK: [2024-04-25 Thu 03:11]--[2024-04-25 Thu 09:59] =>  6:48
:END:
*The Vlasov equation is obtained in the limit of high particle density* \( n = N/V \), *or large interparticle interaction range* \( \lambda \), *such that* \( n\lambda^3 \gg 1 \). *In this limit, the collision terms are dropped from the left-hand side of the equations in the BBGKY hierarchy.*

*The BBGKY hierarchy*

\begin{align*}
\bigg[ \partial_{t} + \sum_{i=1}^{s} (\vec{p}_i/m) \cdot \partial_{\vec{q}_i} - \sum_{i=1}^{s} \bigg( \partial_{\vec{q}_i} U + \sum_{i^\prime=1}^{l} \partial_{\vec{q}_i} \, \partial_{\vec{q}_{i^\prime}}  &V (\vec{q}_i - \vec{q}_{i^\prime}) \bigg) \cdot \partial_{\vec{p}_i} \bigg] f_s \\
&= \bigg[ \sum_{i=1}^{s} \int \mathrm{d}\mathbf{V}_{s+1}\, \partial_{\vec{q}_i} V(\vec{q}_i - \vec{q}_{s+1}) \,\partial_{\vec{p}_i} \bigg] f_{s+1} \tag{1}
\end{align*}

*has the characteristic time scales*

\[
\tau_U^{-1} \sim \partial_{\vec{q}} U \cdot \partial_{\vec{p}} \approx (v/L), \qquad \tau_c^{-1} \sim \partial_{\vec{q}} \mathcal{V} \cdot \partial_{\vec{p}} \approx (v/\lambda), \qquad \tau_\times^{-1} \sim \int \mathrm{d}V\, \partial_{\vec{q}} \mathcal{V} \, \partial_{\vec{p}} \, (f_{s+1}/f_s) \approx \tau_c^{-1} \cdot n \lambda^3
\]

*where* \( n\lambda^3 \) *is the number of particles within the interaction range* \( \lambda \), *and* \( v \) *is a typical velocity. The Boltzmann equation is obtained in the dilute limit,* \( n\lambda^3 \ll 1 \), *by disregarding terms of order* \( \tau_x^{-1} \ll \tau_c^{-1} \). *The Vlasov equation is obtained in the dense limit of* \( n\lambda^3 \gg 1 \) *by ignoring terms of order* \( \tau_c^{-1} \ll \tau_x^{-1} \).

Next: [[id:84d548b9-50e8-497e-b0d1-3d54c035d023][Two-component plasma]]

** 3.3.1
*Assume that the N-body density is a product of one-particle densities, that is,* \( \rho = \prod_{i=1}^N \rho_i(x_i,\,t) \), *where* \(x_i = (\vec{p}_i,\,\vec{q}_i)\). *Calculate the densities* \( f_s \), *and their normalizations.*

The [[id:261ca926-8250-4eaa-9974-ad0839ed3680][s-particle density]] is given by

\begin{align*}
f_s(\vec{p}, \vec{q}, t) = \frac{N!}{(N-s)!} \int \prod_{i=s+1}^N \mathrm{~d} V_i\,\rho (\mathbf{p},\,\mathbf{q},\,t)
\end{align*}

where \(\mathrm{d} V_i=\mathrm{d}^3 \vec{p}_i \mathrm{~d}^3 \vec{q}_i = \mathrm{d} x_i\) is the contribution of particle \(i\) to phase space volume. Substituting the assumed decomposition of the [[id:21d62749-69ab-4e25-b366-eb6ff17a2f09][phase space density]] \( \rho (\mathbf{p},\,\mathbf{q},\,t) = \prod_{i=1}^N \rho_1 (x_i,\,t) \) where \( x_i \equiv (\vec{p}_i,\,\vec{q}_i)\) we have

\begin{align*}
f_s & = \frac{N!}{(N-s)!} \int \prod_{i=s+1}^N \mathrm{d} x_i \, \prod_{j=1}^N \rho_1 (x_j,\,t) \\
& = \frac{N!}{(N-s)!} \prod_{i=1}^s \rho_1 (x_i,\,t) \bigg[ \prod_{j=s+1}^{N} \underbrace{\int \mathrm{d} x_j \, \rho_1 (x_j,\,t)}_{\equiv 1} \bigg] =\frac{N!}{(N-s)!} \prod_{i=1}^s \rho_1 (x_i,\,t).
\end{align*}

** 3.3.2
*Show that once the collision terms are eliminated, all the equations in the BBGKY hierarchy are equivalent to the single equation*

\[
\bigg[ \partial_{t} + (\vec{p}/m) \cdot \partial_{\vec{q}} - \partial_{\vec{q}} U_{\mathrm{eff}} \cdot \partial_{\vec{p}} \bigg]\,f_{1} (\vec{p},\,\vec{q},\,t) = 0
\]

*where*

\[
U_{\mathrm{eff}}(\vec{q},\,t) = U(\vec{q}) + \int \mathrm{d} \mathbf{x}^{\prime} \mathcal{V}(\vec{q} - \vec{q}^{\thinspace \prime}) f_{1}(\mathbf{x}^{\prime},\,t)
\]

The Vlasov equation is obtained in the dense limit of \( n\lambda^3 \gg 1 \), in contrast with the [[id:1d6a703e-1e34-4c07-8d66-c80b6b4bb1ef][the Boltzmann equation]], by ignoring terms of order \(\tau_c^{-1} \ll  \tau_x^{-1}\) from the left hand side of the BBGKY hierarchy. Doing so in (1) yields

\begin{align*}
\bigg[ \partial_{t} + \sum_{i=1}^{s} \bigg( (\vec{p}_i/m) \cdot \partial_{\vec{q}_i} - \partial_{\vec{q}_i} U \cdot \partial_{\vec{p}_i} \bigg) \bigg] f_s = \bigg[ \sum_{i=1}^{s} \int \mathrm{d}V_{s+1}\, \partial_{\vec{q}_i} \mathcal{V} (\vec{q}_i - \vec{q}_{s+1}) \,\partial_{\vec{p}_i} \bigg] f_{s+1}. \tag{2}
\end{align*}

In (3.3.1), we found \(f_s = \frac{N!}{(N-s)!} \prod_{i=1}^s \rho_1 (x_i,\,t)\). For \( N \gg s \), \(\frac{N!}{(N-s)!} \approx N^s\). Therefore \( f_s \approx N^s \prod_{i=1}^s \rho_1 (x_i, \, t) \) and \( f_{s+1} = N^{s+1} \prod_{i=1}^{s+1} \rho_1 (x_i, \, t) \). Using of the method of [[id:dbb10b5f-3ff6-4dc3-ab61-adcdb4ba5ddb][separation of variables]], we substitute \( f_s \) and \( f_{s+1} \) in [[id:0f74dbc6-6e75-44b9-8c93-eebb92805033][the BBGKY hierarchy]] (2) and rearrange to obtain

\begin{align*}
\bigg[ \partial_{t} + \sum_{i=1}^{s}  \bigg((\vec{p}_i/m) \cdot \partial_{\vec{q}_i} &- \partial_{\vec{q}_i} \underbrace{\bigg[U (\vec{q}_i) + \int \mathrm{d}V_{s+1}\,\mathcal{V} (\vec{q}_i - \vec{q}_{s+1})\,f_{1} (\vec{q}_{s+1},\,\vec{p}_{s+1},\,t)\bigg]}_{U_{\text{eff}} (\vec{q}_i,\,t)} \,\partial_{\vec{p}_i} \bigg) \bigg] \prod_{j=1}^s \rho_{1} (x_j,\,t) = 0,
\end{align*}

where we have introduced \(U_{\mathrm{eff}}(\vec{q}_i,\,t) \equiv U (\vec{q}_i) + \int \mathrm{d}V_{s+1}\,\mathcal{V}(\vec{q}_i - \vec{q}_{s+1})\,f_{1} (\vec{q}_{s+1},\,\vec{p}_{s+1},\,t)\). Note how \( U_{\text{eff}} \) is time-dependent while \(U\) is not. Under the action of the operator on the left hand side of the above equation on \( \prod_{j=1}^s \rho_{1} (x_j,\,t) \)

\begin{align*}
\sum_{i=1}^s \prod_{k \neq i}^{s} \rho_1 (x_k,\,t) \, \bigg[\partial_{t} + (\vec{p}_i/m) \cdot \partial_{\vec{q}_i} &- \partial_{\vec{q}_i} U_{\text{eff}} (\vec{q}_i,\, t) \cdot \partial_{\vec{p}_i} \bigg] \rho_{1} (x_i,\,t) = 0,
\end{align*}

which when divided by \( \prod_{j=1}^s \rho_1 (x_j,\,t) \) on both sides yields

\begin{align*}
\sum_{i=1}^s (\rho_1 (x_i,\,t))^{-1} \, \bigg[\partial_{t} + (\vec{p}_i/m) \cdot \partial_{\vec{q}_i} &- \partial_{\vec{q}_i} U_{\text{eff}} (\vec{q}_i,\, t) \cdot \partial_{\vec{p}_i} \bigg] \rho_{1} (x_i,\,t) = 0. \tag{3}
\end{align*}

The \( i^{\text{th}} \) term in the \( \sum \) on the left hand side of (3) is a function only of \( (\vec{q}_i,\,\vec{p}_i) \) so each term must equal some constant value, say \( c \), so that \( s \cdot c = 0 \). Since \( s > 0 \), we must have \( c = 0 \), i.e., each term in the \( \sum \) on the left hand side of (3) must vanish identically. Using the trivial proportionality \( f_1 = N \rho_1 \) relating the [[id:261ca926-8250-4eaa-9974-ad0839ed3680][s-particle density]] and the marginals of the [[id:21d62749-69ab-4e25-b366-eb6ff17a2f09][phase space density]] yields the Vlasov equation

\[
\big[\partial_{t} + (\vec{p}/m) \cdot \partial_{\vec{q}} &- \partial_{\vec{q}} U_{\text{eff}} (\vec{q},\, t) \cdot \partial_{\vec{p}} \big]\,f_{1} (\vec{p},\,\vec{q},\,t) = 0, \tag{4}
\]

where

\[
U_{\mathrm{eff}}(\vec{q},\,t) \equiv U(\vec{q}) + \int \mathrm{d} \mathbf{x}^{\prime}\, \mathcal{V} (\vec{q} - \vec{q}^{\thinspace \prime}) \, f_{1} (\mathbf{x}^{\prime},\,t). \tag{5}
\]

We have dropped the index \( i \) to emphasize that the above equation governs the evolution of the one-particle density for /any/ arbitrary particle with coordinate and momentum \( (\vec{q},\,\vec{p}) \). /This follows from the factorization of the phase space density as the product of one-particle densities./

** 3.3.3
*Now consider* \( N \) *particles confined to a box of volume* \( V \), *with no additional potential. Show that* \( f_{1}(\vec{q}, \vec{p}) = g(\vec{p}) / V \) *is a stationary solution to the Vlasov equation for any* \( g(\vec{p}) \). *Why is there no relaxation toward equilibrium for* \( g(\vec{p}) \)?

First let us evalute \( U_{\text{eff}} \) (see 3.3.2).

\begin{align*}
U_{\mathrm{eff}} &\equiv U(\vec{q}) + \int \mathrm{d}^3\vec{q}^{\thinspace \prime}\, \mathrm{d}^3\vec{p}^{\thinspace \prime}\,\mathcal{V} (\vec{q} - \vec{q}^{\thinspace \prime}) \, f_{1} (\vec{q}^{\thinspace \prime},\,\vec{p}^{\thinspace \prime},\,t)
\xrightarrow[f_1 = g]{U(\vec{q}) \equiv 0} \\
&= (N/V) \int \mathrm{d}^3\vec{q}^{\thinspace \prime}\, \mathrm{d}^3\vec{p}^{\thinspace \prime}\,\mathcal{V} (\vec{q}-\vec{q}^{\thinspace \prime})\,g(\vec{p}^{\thinspace \prime}) 
\xrightarrow{\int \mathrm{d}x\,\mathrm{d}y\, f(x)\,g(y) = \big(\int \mathrm{d}x\,f(x)\big) \big(\int \mathrm{d}y\,g(y) \big)} \\
&= (N/V) \bigg( \int \mathrm{d}^3\vec{q}^{\thinspace \prime}\,\mathcal{V} (\vec{q}-\vec{q}^{\thinspace \prime})\bigg) \bigg(\int \mathrm{d}^3\vec{p}^{\thinspace \prime}\,g(\vec{p}^{\prime}) \bigg) \xrightarrow[\mathcal{V}(\vec{q}) \equiv \mathcal{V}(-\vec{q})]{-\vec{q}^{\thinspace \prime \prime} = \, \vec{q}-\vec{q}^{\thinspace \prime}} \\
&= (N/V) 
\underbrace{
\bigg(\int \mathrm{d}^3\vec{q}^{\thinspace \prime \prime}\,
\mathcal{V}(\vec{q}^{\thinspace \prime \prime})\bigg)
}_{\text{constant}} 
\underbrace{
\bigg(\int \mathrm{d}^3\vec{p}^{\thinspace \prime}\,g(\vec{p}^{\prime})\bigg)
}_{\text{constant}}.
\end{align*}

Plugging \( U_{\text{eff}} \) and  \(f_1(\vec{q}, \vec{p})=g(\vec{p}) / V\) into the Vlasov equation it is evident that \(f_1(\vec{p}, \vec{q})=g(\vec{p}) / V\) is a solution for any \( g (\vec{p}) \):

\begin{align*}
0 &= \big[\partial_{t} + (\vec{p}/m) \cdot \partial_{\vec{q}} - \partial_{\vec{q}} U_{\text{eff}} (\vec{q},\, t) \cdot \partial_{\vec{p}} \big]\,f_{1} (\vec{p},\,\vec{q},\,t)
\xrightarrow[U_{\text{eff}} (\vec{q},\,t) = U_{\text{eff}}]{f_{1} (\vec{p},\,\vec{q},\,t) = g(\vec{p})/V}\\
&= V^{-1} \big[\partial_{t} g (\vec{p}) + (\vec{p}/m) \cdot \partial_{\vec{q}} g (\vec{p}) - \partial_{\vec{q}} U_{\text{eff}} \cdot \partial_{\vec{p}} \, g (\vec{p}) \big]
\xrightarrow[\partial_{\vec{q}} U_{\text{eff}} = 0]{\partial_t g(\vec{p})=0,\,\partial_{\vec{q}} g(\vec{p}) = 0} = 0.
\end{align*}

\(g(\vec{p}) / V\) is a /solution/ of the Vlasov equation. It is a /stationary/ density because \( \partial_t g(\vec{p}) = \partial_{\vec{q}} U_{\text{eff}} \cdot \partial_{\vec{p}} \, g(\vec{p}) = 0 \) (\( \partial_{\vec{q}} U_{\text{eff}}\) vanishes). \(g(\vec{p}) / V\) is therefore a /stationary solution/.

This system is equivalent to a system of free particle that pass right through each other. With /no/ collisions, time-dependent variations \((\delta \vec{p}(t),\,\delta \vec{q}(t))\) vanish identically. Therefore, \( g (\vec{p}) \) does not relax.

#+BEGIN_COMMENT
We have already encountered a similar situation in the problem on the [[id:54029e29-f615-4482-919f-022e50022ae2][one-dimensional gas]], where the Hamiltonian was a function of the particle momenta only and /not/ a function of their coordinates, rendering half of the canonical equations trivial.

Note, that while an ensemble of [[id:2b3acff9-a43f-4fc5-92d8-a1296fb3f0f7][microstates]] corresponding to an equilibrium [[id:d351a06e-42c5-4a72-98c9-bbfe8f40afe7][macrostate]] implies a stationary [[id:21d62749-69ab-4e25-b366-eb6ff17a2f09][phase space density]], i.e., \( \partial_t \, \rho_{\text{eq}} = 0 \), a stationary phase space density need not necessarily imply that the system is in equilibrium. Macroscopic equilibrium is associated with /stable stationary phase space densities/.
#+END_COMMENT
